### 1. Importing Libraries

In [1]:
import os
import pandas as pd
import numpy as np

### 2. Reading Data

In [6]:
orders = pd.read_csv("List of Orders.csv")
order_details = pd.read_csv("Order Details.csv")
sales = pd.read_csv("Sales target.csv")

In [8]:
orders.head()

  Order ID  Order Date CustomerName           State       City
0  B-25601  01-04-2018       Bharat         Gujarat  Ahmedabad
1  B-25602  01-04-2018        Pearl     Maharashtra       Pune
2  B-25603  03-04-2018        Jahan  Madhya Pradesh     Bhopal
3  B-25604  03-04-2018       Divsha       Rajasthan     Jaipur
4  B-25605  05-04-2018      Kasheen     West Bengal    Kolkata

In [9]:
order_details.head()

  Order ID  Amount  Profit  Quantity     Category      Sub-Category
0  B-25601  1275.0 -1148.0         7    Furniture         Bookcases
1  B-25601    66.0   -12.0         5     Clothing             Stole
2  B-25601     8.0    -2.0         3     Clothing       Hankerchief
3  B-25601    80.0   -56.0         4  Electronics  Electronic Games
4  B-25602   168.0  -111.0         2  Electronics            Phones

In [10]:
sales.head()

  Month of Order Date   Category   Target
0              Apr-18  Furniture  10400.0
1              May-18  Furniture  10500.0
2              Jun-18  Furniture  10600.0
3              Jul-18  Furniture  10800.0
4              Aug-18  Furniture  10900.0

### 3. Joining Dataset

In [11]:
df = pd.merge(orders, order_details, on='Order ID', how='inner')

In [12]:
df

,Order ID,Order Date,CustomerName,State,City,Amount,Profit,Quantity,Category,Sub-Category
0,B-25601,01-04-2018,Bharat,Gujarat,Ahmedabad,1275.0,-1148.0,7,Furniture,Bookcases
1,B-25601,01-04-2018,Bharat,Gujarat,Ahmedabad,66.0,-12.0,5,Clothing,Stole
2,B-25601,01-04-2018,Bharat,Gujarat,Ahmedabad,8.0,-2.0,3,Clothing,Hankerchief
3,B-25601,01-04-2018,Bharat,Gujarat,Ahmedabad,80.0,-56.0,4,Electronics,Electronic Games
4,B-25602,01-04-2018,Pearl,Maharashtra,Pune,168.0,-111.0,2,Electronics,Phones
...,...,...,...,...,...,...,...,...,...,...
1495,B-26099,30-03-2019,Bhishm,Maharashtra,Mumbai,835.0,267.0,5,Electronics,Phones
1496,B-26099,30-03-2019,Bhishm,Maharashtra,Mumbai,2366.0,552.0,5,Clothing,Trousers
1497,B-26100,31-03-2019,Hitika,Madhya Pradesh,Indore,828.0,230.0,2,Furniture,Chairs
1498,B-26100,31-03-2019,Hitika,Madhya Pradesh,Indore,34.0,10.0,2,Clothing,T-shirt
1499,B-26100,31-03-2019,Hitika,Madhya Pradesh,Indore,72.0,16.0,2,Clothing,Shirt

### 4. Preliminary Analysis

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1500 entries, 0 to 1499
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order ID      1500 non-null   object
 1   Order Date    1500 non-null   object
 2   CustomerName  1500 non-null   object
 3   State         1500 non-null   object
 4   City          1500 non-null   object
 5   Amount        1500 non-null   float64
 6   Profit        1500 non-null   float64
 7   Quantity      1500 non-null   int64
 8   Category      1500 non-null   object
 9   Sub-Category  1500 non-null   object
dtypes: float64(2), int64(1), object(7)
memory usage: 128.9+ KB

- data set contains 1500 rows and 10 features

#### 3.1 Check Data types

In [15]:
df.dtypes

Order ID         object
Order Date       object
CustomerName     object
State            object
City             object
Amount          float64
Profit          float64
Quantity          int64
Category         object
Sub-Category     object
dtype: object

#### 3.2 Check for Duplicates

In [16]:
df.duplicated().sum()

0

### 4. Detailed Analysis (wrt each feature)

In [17]:
df.CustomerName

0       Bharat
1       Bharat
2       Bharat
3       Bharat
4        Pearl
         ...
1495    Bhishm
1496    Bhishm
1497    Hitika
1498    Hitika
1499    Hitika
Name: CustomerName, Length: 1500, dtype: object

In [25]:
df['Order Date']

0       01-04-2018
1       01-04-2018
2       01-04-2018
3       01-04-2018
4       01-04-2018
           ...
1495    30-03-2019
1496    30-03-2019
1497    31-03-2019
1498    31-03-2019
1499    31-03-2019
Name: Order Date, Length: 1500, dtype: object

In [26]:
pd.to_datetime(df['Order Date'], dayfirst=True)

0      2018-04-01
1      2018-04-01
2      2018-04-01
3      2018-04-01
4      2018-04-01
          ...
1495   2019-03-30
1496   2019-03-30
1497   2019-03-31
1498   2019-03-31
1499   2019-03-31
Name: Order Date, Length: 1500, dtype: datetime64[ns]

In [27]:
df.Category.unique()

array(['Furniture', 'Clothing', 'Electronics'], dtype=object)

In [29]:
df['Sub-Category'].unique()

array(['Bookcases', 'Stole', 'Hankerchief', 'Electronic Games', 'Phones',
       'Saree', 'Trousers', 'Chairs', 'Kurti', 'T-shirt', 'Shirt',
       'Leggings', 'Tables', 'Printers', 'Accessories', 'Furnishings',
       'Skirt'], dtype=object)

In [31]:
df.State

0              Gujarat
1              Gujarat
2              Gujarat
3              Gujarat
4          Maharashtra
             ...
1495       Maharashtra
1496       Maharashtra
1497    Madhya Pradesh
1498    Madhya Pradesh
1499    Madhya Pradesh
Name: State, Length: 1500, dtype: object

In [32]:
df.City

0       Ahmedabad
1       Ahmedabad
2       Ahmedabad
3       Ahmedabad
4            Pune
          ...
1495       Mumbai
1496       Mumbai
1497       Indore
1498       Indore
1499       Indore
Name: City, Length: 1500, dtype: object